<demo>
基本用法
</demo>
<template>
  <div class="wrap">
    <BackTop :style="{ maxHeight: '500px' }">
      <template #action>
        <Button>go Top</Button>
      </template>
      <p>我是最顶端.....</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
      <p>明月几时有？把酒问青天。不知天上宫阙，今夕是何年。</p>
    </BackTop>
  </div>
</template>

<script setup lang="ts">
import { BackTop, Button } from '@/lib'
</script>

<style lang="scss" scoped>
.wrap {
  p {
    font-size: 14px;
    line-height: 2em;
  }
}
</style>
